[Killed] BlockStatement
dist/src/prices.js:2:72
 "use strict";
-var __importDefault = (this && this.__importDefault) || function (mod) {
-    return (mod && mod.__esModule) ? mod : { "default": mod };
-};
+var __importDefault = (this && this.__importDefault) || function (mod) {};
 Object.defineProperty(exports, "__esModule", { value: true });
 exports.createApp = void 0;
killedBy: prices given age below threshold, the cost is 0; prices given age below threshold, the cost is 0
statusReason: Cannot read properties of undefined (reading 'default')

[Survived] ConditionalExpression
dist/src/prices.js:2:24
 "use strict";
-var __importDefault = (this && this.__importDefault) || function (mod) {
+var __importDefault = (false) || function (mod) {
     return (mod && mod.__esModule) ? mod : { "default": mod };
 };

[Killed] ConditionalExpression
dist/src/prices.js:3:13
 "use strict";
 var __importDefault = (this && this.__importDefault) || function (mod) {
-    return (mod && mod.__esModule) ? mod : { "default": mod };
+    return (true) ? mod : { "default": mod };
 };
 Object.defineProperty(exports, "__esModule", { value: true });
killedBy: prices given age below threshold, the cost is 0; prices given age below threshold, the cost is 0
statusReason: (0 , express_1.default) is not a function

[Killed] LogicalOperator
dist/src/prices.js:3:13
 "use strict";
 var __importDefault = (this && this.__importDefault) || function (mod) {
-    return (mod && mod.__esModule) ? mod : { "default": mod };
+    return (mod || mod.__esModule) ? mod : { "default": mod };
 };
 Object.defineProperty(exports, "__esModule", { value: true });
killedBy: prices given age below threshold, the cost is 0; prices given age below threshold, the cost is 0
statusReason: (0 , express_1.default) is not a function

[Survived] BooleanLiteral
dist/src/prices.js:5:55
 var __importDefault = (this && this.__importDefault) || function (mod) {
     return (mod && mod.__esModule) ? mod : { "default": mod };
 };
-Object.defineProperty(exports, "__esModule", { value: true });
+Object.defineProperty(exports, "__esModule", { value: false });
 exports.createApp = void 0;
 const express_1 = __importDefault(require("express"));

[Survived] ObjectLiteral
dist/src/prices.js:5:46
 var __importDefault = (this && this.__importDefault) || function (mod) {
     return (mod && mod.__esModule) ? mod : { "default": mod };
 };
-Object.defineProperty(exports, "__esModule", { value: true });
+Object.defineProperty(exports, "__esModule", {});
 exports.createApp = void 0;
 const express_1 = __importDefault(require("express"));

[Survived] StringLiteral
dist/src/prices.js:11:37
 const promise_1 = __importDefault(require("mysql2/promise"));
 async function createApp() {
     const app = (0, express_1.default)();
-    let connectionOptions = { host: 'localhost', user: 'root', database: 'lift_pass', password: 'mysql' };
+    let connectionOptions = { host: "", user: 'root', database: 'lift_pass', password: 'mysql' };
     const connection = await promise_1.default.createConnection(connectionOptions);
     app.put('/prices', async (req, res) => {

[Timeout] BlockStatement
dist/src/prices.js:13:44
     const app = (0, express_1.default)();
     let connectionOptions = { host: 'localhost', user: 'root', database: 'lift_pass', password: 'mysql' };
     const connection = await promise_1.default.createConnection(connectionOptions);
-    app.put('/prices', async (req, res) => {
-        const liftPassCost = req.query.cost;
-        const liftPassType = req.query.type;
-        const [rows, fields] = await connection.query('INSERT INTO `base_price` (type, cost) VALUES (?, ?) ' +
-            'ON DUPLICATE KEY UPDATE cost = ?', [liftPassType, liftPassCost, liftPassCost]);
-        res.json();
-    });
+    app.put('/prices', async (req, res) => {});
     app.get('/prices', async (req, res) => {
         const result = (await connection.query('SELECT cost FROM `base_price` ' +

[Timeout] StringLiteral
dist/src/prices.js:17:13
         const liftPassCost = req.query.cost;
         const liftPassType = req.query.type;
         const [rows, fields] = await connection.query('INSERT INTO `base_price` (type, cost) VALUES (?, ?) ' +
-            'ON DUPLICATE KEY UPDATE cost = ?', [liftPassType, liftPassCost, liftPassCost]);
+            "", [liftPassType, liftPassCost, liftPassCost]);
         res.json();
     });

[Killed] StringLiteral
dist/src/prices.js:20:13
             'ON DUPLICATE KEY UPDATE cost = ?', [liftPassType, liftPassCost, liftPassCost]);
         res.json();
     });
-    app.get('/prices', async (req, res) => {
+    app.get("", async (req, res) => {
         const result = (await connection.query('SELECT cost FROM `base_price` ' +
             'WHERE `type` = ? ', [req.query.type]))[0][0];
killedBy: prices given age below threshold, the cost is 0
statusReason: expected {} to deeply equal { cost: +0 }

[Killed] StringLiteral
dist/src/prices.js:22:13
     });
     app.get('/prices', async (req, res) => {
         const result = (await connection.query('SELECT cost FROM `base_price` ' +
-            'WHERE `type` = ? ', [req.query.type]))[0][0];
+            "", [req.query.type]))[0][0];
         if (req.query.age < 6) {
             res.json({ cost: 0 });
killedBy: prices night time cost given an age matching the first threshold
statusReason: expected { cost: 35 } to deeply equal { cost: 19 }

[Killed] EqualityOperator
dist/src/prices.js:23:13
     app.get('/prices', async (req, res) => {
         const result = (await connection.query('SELECT cost FROM `base_price` ' +
             'WHERE `type` = ? ', [req.query.type]))[0][0];
-        if (req.query.age < 6) {
+        if (req.query.age >= 6) {
             res.json({ cost: 0 });
         }
killedBy: prices given age below threshold, the cost is 0
statusReason: expected { cost: 25 } to deeply equal { cost: +0 }

[Killed] ConditionalExpression
dist/src/prices.js:23:13
     app.get('/prices', async (req, res) => {
         const result = (await connection.query('SELECT cost FROM `base_price` ' +
             'WHERE `type` = ? ', [req.query.type]))[0][0];
-        if (req.query.age < 6) {
+        if (true) {
             res.json({ cost: 0 });
         }
killedBy: prices day time cost for ages below the first threshold on any date the first day of the week
statusReason: expected { cost: +0 } to deeply equal { cost: 25 }

[Killed] ConditionalExpression
dist/src/prices.js:27:17
             res.json({ cost: 0 });
         }
         else {
-            if (req.query.type !== 'night') {
+            if (true) {
                 const holidays = (await connection.query('SELECT * FROM `holidays`'))[0];
                 let isHoliday;
killedBy: prices night time cost given no age
statusReason: expected { cost: 19 } to deeply equal { cost: +0 }

[Killed] ConditionalExpression
dist/src/prices.js:27:17
             res.json({ cost: 0 });
         }
         else {
-            if (req.query.type !== 'night') {
+            if (false) {
                 const holidays = (await connection.query('SELECT * FROM `holidays`'))[0];
                 let isHoliday;
killedBy: prices day time cost for ages below the first threshold on any date the first day of the week
statusReason: expected { cost: 35 } to deeply equal { cost: 25 }

[Killed] BlockStatement
dist/src/prices.js:31:43
                 const holidays = (await connection.query('SELECT * FROM `holidays`'))[0];
                 let isHoliday;
                 let reduction = 0;
-                for (let row of holidays) {
-                    let holiday = row.holiday;
-                    let d = new Date(req.query.date);
-                    if (d.getFullYear() === holiday.getFullYear()
-                        && d.getMonth() === holiday.getMonth()
-                        && d.getDate() === holiday.getDate()) {
-                        isHoliday = true;
-                    }
-                }
+                for (let row of holidays) {}
                 if (!isHoliday && new Date(req.query.date).getDay() === 1) {
                     reduction = 35;
killedBy: prices day time cost on a holiday date on the first day of the week given no age
statusReason: expected { cost: 23 } to deeply equal { cost: 35 }

[Killed] EqualityOperator
dist/src/prices.js:34:25
                 for (let row of holidays) {
                     let holiday = row.holiday;
                     let d = new Date(req.query.date);
-                    if (d.getFullYear() === holiday.getFullYear()
+                    if (d.getFullYear() !== holiday.getFullYear()
                         && d.getMonth() === holiday.getMonth()
                         && d.getDate() === holiday.getDate()) {
killedBy: prices day time cost on a holiday date on the first day of the week given no age
statusReason: expected { cost: 23 } to deeply equal { cost: 35 }

[Killed] ConditionalExpression
dist/src/prices.js:34:25
                 for (let row of holidays) {
                     let holiday = row.holiday;
                     let d = new Date(req.query.date);
-                    if (d.getFullYear() === holiday.getFullYear()
-                        && d.getMonth() === holiday.getMonth()
-                        && d.getDate() === holiday.getDate()) {
+                    if (false) {
                         isHoliday = true;
                     }
killedBy: prices day time cost on a holiday date on the first day of the week given no age
statusReason: expected { cost: 23 } to deeply equal { cost: 35 }

[Killed] EqualityOperator
dist/src/prices.js:35:28
                     let holiday = row.holiday;
                     let d = new Date(req.query.date);
                     if (d.getFullYear() === holiday.getFullYear()
-                        && d.getMonth() === holiday.getMonth()
+                        && d.getMonth() !== holiday.getMonth()
                         && d.getDate() === holiday.getDate()) {
                         isHoliday = true;
killedBy: prices day time cost on a holiday date on the first day of the week given no age
statusReason: expected { cost: 23 } to deeply equal { cost: 35 }

[Survived] ConditionalExpression
dist/src/prices.js:35:28
                     let holiday = row.holiday;
                     let d = new Date(req.query.date);
                     if (d.getFullYear() === holiday.getFullYear()
-                        && d.getMonth() === holiday.getMonth()
+                        && true
                         && d.getDate() === holiday.getDate()) {
                         isHoliday = true;

[Killed] BlockStatement
dist/src/prices.js:36:63
                     let d = new Date(req.query.date);
                     if (d.getFullYear() === holiday.getFullYear()
                         && d.getMonth() === holiday.getMonth()
-                        && d.getDate() === holiday.getDate()) {
-                        isHoliday = true;
-                    }
+                        && d.getDate() === holiday.getDate()) {}
                 }
                 if (!isHoliday && new Date(req.query.date).getDay() === 1) {
killedBy: prices day time cost on a holiday date on the first day of the week given no age
statusReason: expected { cost: 23 } to deeply equal { cost: 35 }

[Survived] ConditionalExpression
dist/src/prices.js:36:28
                     let d = new Date(req.query.date);
                     if (d.getFullYear() === holiday.getFullYear()
                         && d.getMonth() === holiday.getMonth()
-                        && d.getDate() === holiday.getDate()) {
+                        && true) {
                         isHoliday = true;
                     }

[Killed] BooleanLiteral
dist/src/prices.js:37:37
                     if (d.getFullYear() === holiday.getFullYear()
                         && d.getMonth() === holiday.getMonth()
                         && d.getDate() === holiday.getDate()) {
-                        isHoliday = true;
+                        isHoliday = false;
                     }
                 }
killedBy: prices day time cost on a holiday date on the first day of the week given no age
statusReason: expected { cost: 23 } to deeply equal { cost: 35 }

[Killed] ConditionalExpression
dist/src/prices.js:40:21
                         isHoliday = true;
                     }
                 }
-                if (!isHoliday && new Date(req.query.date).getDay() === 1) {
+                if (true) {
                     reduction = 35;
                 }
killedBy: prices day time cost for ages equal to the first threshold on any date a non-first day of the week
statusReason: expected { cost: 23 } to deeply equal { cost: 35 }

[Killed] LogicalOperator
dist/src/prices.js:40:21
                         isHoliday = true;
                     }
                 }
-                if (!isHoliday && new Date(req.query.date).getDay() === 1) {
+                if (!isHoliday || new Date(req.query.date).getDay() === 1) {
                     reduction = 35;
                 }
killedBy: prices day time cost for ages equal to the first threshold on any date a non-first day of the week
statusReason: expected { cost: 23 } to deeply equal { cost: 35 }

[Killed] ConditionalExpression
dist/src/prices.js:44:21
                     reduction = 35;
                 }
                 // TODO apply reduction for others
-                if (req.query.age < 15) {
+                if (false) {
                     res.json({ cost: Math.ceil(result.cost * .7) });
                 }
killedBy: prices day time cost for ages below the first threshold on any date the first day of the week
statusReason: expected { cost: 23 } to deeply equal { cost: 25 }

[Killed] ConditionalExpression
dist/src/prices.js:44:21
                     reduction = 35;
                 }
                 // TODO apply reduction for others
-                if (req.query.age < 15) {
+                if (true) {
                     res.json({ cost: Math.ceil(result.cost * .7) });
                 }
killedBy: prices day time cost for ages equal to the first threshold on any date the first day of the week
statusReason: expected { cost: 25 } to deeply equal { cost: 23 }

[Killed] ArithmeticOperator
dist/src/prices.js:45:48
                 }
                 // TODO apply reduction for others
                 if (req.query.age < 15) {
-                    res.json({ cost: Math.ceil(result.cost * .7) });
+                    res.json({ cost: Math.ceil(result.cost / .7) });
                 }
                 else {
killedBy: prices day time cost for ages below the first threshold on any date the first day of the week
statusReason: expected { cost: 50 } to deeply equal { cost: 25 }

[Killed] ObjectLiteral
dist/src/prices.js:45:30
                 }
                 // TODO apply reduction for others
                 if (req.query.age < 15) {
-                    res.json({ cost: Math.ceil(result.cost * .7) });
+                    res.json({});
                 }
                 else {
killedBy: prices day time cost for ages below the first threshold on any date the first day of the week
statusReason: expected {} to deeply equal { cost: 25 }

[Timeout] BlockStatement
dist/src/prices.js:47:22
                 if (req.query.age < 15) {
                     res.json({ cost: Math.ceil(result.cost * .7) });
                 }
-                else {
-                    if (req.query.age === undefined) {
-                        let cost = result.cost * (1 - reduction / 100);
-                        res.json({ cost: Math.ceil(cost) });
-                    }
-                    else {
-                        if (req.query.age > 64) {
-                            let cost = result.cost * .75 * (1 - reduction / 100);
-                            res.json({ cost: Math.ceil(cost) });
-                        }
-                        else {
-                            let cost = result.cost * (1 - reduction / 100);
-                            res.json({ cost: Math.ceil(cost) });
-                        }
-                    }
-                }
+                else {}
             }
             else {

[Killed] ConditionalExpression
dist/src/prices.js:48:25
                     res.json({ cost: Math.ceil(result.cost * .7) });
                 }
                 else {
-                    if (req.query.age === undefined) {
+                    if (true) {
                         let cost = result.cost * (1 - reduction / 100);
                         res.json({ cost: Math.ceil(cost) });
killedBy: prices day time cost on the first day of the week (non-holiday) given age above threshold
statusReason: expected { cost: 23 } to deeply equal { cost: 18 }

[Killed] EqualityOperator
dist/src/prices.js:48:25
                     res.json({ cost: Math.ceil(result.cost * .7) });
                 }
                 else {
-                    if (req.query.age === undefined) {
+                    if (req.query.age !== undefined) {
                         let cost = result.cost * (1 - reduction / 100);
                         res.json({ cost: Math.ceil(cost) });
killedBy: prices day time cost on the first day of the week (non-holiday) given age above threshold
statusReason: expected { cost: 23 } to deeply equal { cost: 18 }

[Killed] ArithmeticOperator
dist/src/prices.js:49:36
                 }
                 else {
                     if (req.query.age === undefined) {
-                        let cost = result.cost * (1 - reduction / 100);
+                        let cost = result.cost / (1 - reduction / 100);
                         res.json({ cost: Math.ceil(cost) });
                     }
killedBy: prices day time cost on the first day of the week (non-holiday) given no age
statusReason: expected { cost: 54 } to deeply equal { cost: 23 }

[Killed] ArithmeticOperator
dist/src/prices.js:49:51
                 }
                 else {
                     if (req.query.age === undefined) {
-                        let cost = result.cost * (1 - reduction / 100);
+                        let cost = result.cost * (1 + reduction / 100);
                         res.json({ cost: Math.ceil(cost) });
                     }
killedBy: prices day time cost on the first day of the week (non-holiday) given no age
statusReason: expected { cost: 48 } to deeply equal { cost: 23 }

[Timeout] BlockStatement
dist/src/prices.js:52:26
                         let cost = result.cost * (1 - reduction / 100);
                         res.json({ cost: Math.ceil(cost) });
                     }
-                    else {
-                        if (req.query.age > 64) {
-                            let cost = result.cost * .75 * (1 - reduction / 100);
-                            res.json({ cost: Math.ceil(cost) });
-                        }
-                        else {
-                            let cost = result.cost * (1 - reduction / 100);
-                            res.json({ cost: Math.ceil(cost) });
-                        }
-                    }
+                    else {}
                 }
             }

[Killed] EqualityOperator
dist/src/prices.js:53:29
                         res.json({ cost: Math.ceil(cost) });
                     }
                     else {
-                        if (req.query.age > 64) {
+                        if (req.query.age <= 64) {
                             let cost = result.cost * .75 * (1 - reduction / 100);
                             res.json({ cost: Math.ceil(cost) });
killedBy: prices day time cost for ages equal to the first threshold on any date the first day of the week
statusReason: expected { cost: 18 } to deeply equal { cost: 23 }

[Killed] ConditionalExpression
dist/src/prices.js:53:29
                         res.json({ cost: Math.ceil(cost) });
                     }
                     else {
-                        if (req.query.age > 64) {
+                        if (false) {
                             let cost = result.cost * .75 * (1 - reduction / 100);
                             res.json({ cost: Math.ceil(cost) });
killedBy: prices day time cost on the first day of the week (non-holiday) given age above threshold
statusReason: expected { cost: 23 } to deeply equal { cost: 18 }

[Killed] ArithmeticOperator
dist/src/prices.js:54:61
                     }
                     else {
                         if (req.query.age > 64) {
-                            let cost = result.cost * .75 * (1 - reduction / 100);
+                            let cost = result.cost * .75 * (1 + reduction / 100);
                             res.json({ cost: Math.ceil(cost) });
                         }
killedBy: prices day time cost on the first day of the week (non-holiday) given age above threshold
statusReason: expected { cost: 36 } to deeply equal { cost: 18 }

[Killed] ArithmeticOperator
dist/src/prices.js:54:40
                     }
                     else {
                         if (req.query.age > 64) {
-                            let cost = result.cost * .75 * (1 - reduction / 100);
+                            let cost = result.cost / .75 * (1 - reduction / 100);
                             res.json({ cost: Math.ceil(cost) });
                         }
killedBy: prices day time cost on the first day of the week (non-holiday) given age above threshold
statusReason: expected { cost: 31 } to deeply equal { cost: 18 }

[Timeout] BlockStatement
dist/src/prices.js:57:30
                             let cost = result.cost * .75 * (1 - reduction / 100);
                             res.json({ cost: Math.ceil(cost) });
                         }
-                        else {
-                            let cost = result.cost * (1 - reduction / 100);
-                            res.json({ cost: Math.ceil(cost) });
-                        }
+                        else {}
                     }
                 }

[Killed] ArithmeticOperator
dist/src/prices.js:58:55
                             res.json({ cost: Math.ceil(cost) });
                         }
                         else {
-                            let cost = result.cost * (1 - reduction / 100);
+                            let cost = result.cost * (1 + reduction / 100);
                             res.json({ cost: Math.ceil(cost) });
                         }
killedBy: prices day time cost for ages equal to the first threshold on any date the first day of the week
statusReason: expected { cost: 48 } to deeply equal { cost: 23 }

[Killed] ArithmeticOperator
dist/src/prices.js:58:40
                             res.json({ cost: Math.ceil(cost) });
                         }
                         else {
-                            let cost = result.cost * (1 - reduction / 100);
+                            let cost = result.cost / (1 - reduction / 100);
                             res.json({ cost: Math.ceil(cost) });
                         }
killedBy: prices day time cost for ages equal to the first threshold on any date the first day of the week
statusReason: expected { cost: 54 } to deeply equal { cost: 23 }

[Killed] ObjectLiteral
dist/src/prices.js:59:38
                         }
                         else {
                             let cost = result.cost * (1 - reduction / 100);
-                            res.json({ cost: Math.ceil(cost) });
+                            res.json({});
                         }
                     }
killedBy: prices day time cost for ages equal to the first threshold on any date the first day of the week
statusReason: expected {} to deeply equal { cost: 23 }

[Timeout] BlockStatement
dist/src/prices.js:64:18
                     }
                 }
             }
-            else {
-                if (req.query.age >= 6) {
-                    if (req.query.age > 64) {
-                        res.json({ cost: Math.ceil(result.cost * .4) });
-                    }
-                    else {
-                        res.json(result);
-                    }
-                }
-                else {
-                    res.json({ cost: 0 });
-                }
-            }
+            else {}
         }
     });

[Killed] EqualityOperator
dist/src/prices.js:65:21
                 }
             }
             else {
-                if (req.query.age >= 6) {
+                if (req.query.age < 6) {
                     if (req.query.age > 64) {
                         res.json({ cost: Math.ceil(result.cost * .4) });
killedBy: prices night time cost given an age matching the first threshold
statusReason: expected { cost: +0 } to deeply equal { cost: 19 }

[Killed] ConditionalExpression
dist/src/prices.js:65:21
                 }
             }
             else {
-                if (req.query.age >= 6) {
+                if (true) {
                     if (req.query.age > 64) {
                         res.json({ cost: Math.ceil(result.cost * .4) });
killedBy: prices night time cost given no age
statusReason: expected { cost: 19 } to deeply equal { cost: +0 }

[Killed] EqualityOperator
dist/src/prices.js:66:25
             }
             else {
                 if (req.query.age >= 6) {
-                    if (req.query.age > 64) {
+                    if (req.query.age <= 64) {
                         res.json({ cost: Math.ceil(result.cost * .4) });
                     }
killedBy: prices night time cost given an age matching the first threshold
statusReason: expected { cost: 8 } to deeply equal { cost: 19 }

[Killed] ConditionalExpression
dist/src/prices.js:66:25
             }
             else {
                 if (req.query.age >= 6) {
-                    if (req.query.age > 64) {
+                    if (true) {
                         res.json({ cost: Math.ceil(result.cost * .4) });
                     }
killedBy: prices night time cost given an age matching the first threshold
statusReason: expected { cost: 8 } to deeply equal { cost: 19 }

[Killed] ArithmeticOperator
dist/src/prices.js:67:52
             else {
                 if (req.query.age >= 6) {
                     if (req.query.age > 64) {
-                        res.json({ cost: Math.ceil(result.cost * .4) });
+                        res.json({ cost: Math.ceil(result.cost / .4) });
                     }
                     else {
killedBy: prices night time cost given an age above the second threshold
statusReason: expected { cost: 48 } to deeply equal { cost: 8 }

[Timeout] BlockStatement
dist/src/prices.js:69:26
                     if (req.query.age > 64) {
                         res.json({ cost: Math.ceil(result.cost * .4) });
                     }
-                    else {
-                        res.json(result);
-                    }
+                    else {}
                 }
                 else {

[Timeout] BlockStatement
dist/src/prices.js:73:22
                         res.json(result);
                     }
                 }
-                else {
-                    res.json({ cost: 0 });
-                }
+                else {}
             }
         }

[Killed] ObjectLiteral
dist/src/prices.js:74:30
                     }
                 }
                 else {
-                    res.json({ cost: 0 });
+                    res.json({});
                 }
             }
killedBy: prices night time cost given no age
statusReason: expected {} to deeply equal { cost: +0 }
