[Killed] BlockStatement
dist/src/prices.js:31:43
                 const holidays = (await connection.query('SELECT * FROM `holidays`'))[0];
                 let isHoliday;
                 let reduction = 0;
-                for (let row of holidays) {
-                    let holiday = row.holiday;
-                    if (req.query.date) {
-                        let d = new Date(req.query.date);
-                        if (d.getFullYear() === holiday.getFullYear()
-                            && d.getMonth() === holiday.getMonth()
-                            && d.getDate() === holiday.getDate()) {
-                            isHoliday = true;
-                        }
-                    }
-                }
+                for (let row of holidays) {}
                 if (!isHoliday && new Date(req.query.date).getDay() === 1) {
                     reduction = 35;
killedBy: prices day time cost on a holiday date on the first day of the week given no age
statusReason: expected { cost: 23 } to deeply equal { cost: 35 }

[Killed] ConditionalExpression
dist/src/prices.js:33:25
                 let reduction = 0;
                 for (let row of holidays) {
                     let holiday = row.holiday;
-                    if (req.query.date) {
+                    if (false) {
                         let d = new Date(req.query.date);
                         if (d.getFullYear() === holiday.getFullYear()
killedBy: prices day time cost on a holiday date on the first day of the week given no age
statusReason: expected { cost: 23 } to deeply equal { cost: 35 }

[Killed] BlockStatement
dist/src/prices.js:33:41
                 let reduction = 0;
                 for (let row of holidays) {
                     let holiday = row.holiday;
-                    if (req.query.date) {
-                        let d = new Date(req.query.date);
-                        if (d.getFullYear() === holiday.getFullYear()
-                            && d.getMonth() === holiday.getMonth()
-                            && d.getDate() === holiday.getDate()) {
-                            isHoliday = true;
-                        }
-                    }
+                    if (req.query.date) {}
                 }
                 if (!isHoliday && new Date(req.query.date).getDay() === 1) {
killedBy: prices day time cost on a holiday date on the first day of the week given no age
statusReason: expected { cost: 23 } to deeply equal { cost: 35 }

[Killed] ConditionalExpression
dist/src/prices.js:35:29
                     let holiday = row.holiday;
                     if (req.query.date) {
                         let d = new Date(req.query.date);
-                        if (d.getFullYear() === holiday.getFullYear()
-                            && d.getMonth() === holiday.getMonth()
-                            && d.getDate() === holiday.getDate()) {
+                        if (true) {
                             isHoliday = true;
                         }
killedBy: prices day time cost for ages equal to the first threshold on any date the first day of the week
statusReason: expected { cost: 35 } to deeply equal { cost: 23 }

[Survived] EqualityOperator
dist/src/prices.js:37:32
                         let d = new Date(req.query.date);
                         if (d.getFullYear() === holiday.getFullYear()
                             && d.getMonth() === holiday.getMonth()
-                            && d.getDate() === holiday.getDate()) {
+                            && d.getDate() !== holiday.getDate()) {
                             isHoliday = true;
                         }

[Killed] BlockStatement
dist/src/prices.js:42:76
                         }
                     }
                 }
-                if (!isHoliday && new Date(req.query.date).getDay() === 1) {
-                    reduction = 35;
-                }
+                if (!isHoliday && new Date(req.query.date).getDay() === 1) {}
                 // TODO apply reduction for others
                 if (req.query.age < 15) {
killedBy: prices day time cost for ages equal to the first threshold on any date the first day of the week
statusReason: expected { cost: 35 } to deeply equal { cost: 23 }

[Killed] ConditionalExpression
dist/src/prices.js:42:35
                         }
                     }
                 }
-                if (!isHoliday && new Date(req.query.date).getDay() === 1) {
+                if (!isHoliday && true) {
                     reduction = 35;
                 }
killedBy: prices day time cost for ages equal to the first threshold on any date a non-first day of the week
statusReason: expected { cost: 23 } to deeply equal { cost: 35 }

[Killed] EqualityOperator
dist/src/prices.js:46:21
                     reduction = 35;
                 }
                 // TODO apply reduction for others
-                if (req.query.age < 15) {
+                if (req.query.age >= 15) {
                     res.json({ cost: Math.ceil(result.cost * .7) });
                 }
killedBy: prices day time cost for ages below the first threshold on any date the first day of the week
statusReason: expected { cost: 23 } to deeply equal { cost: 25 }

[Killed] ConditionalExpression
dist/src/prices.js:55:29
                         res.json({ cost: Math.ceil(cost) });
                     }
                     else {
-                        if (req.query.age > 64) {
+                        if (true) {
                             let cost = result.cost * .75 * (1 - reduction / 100);
                             res.json({ cost: Math.ceil(cost) });
killedBy: prices day time cost for ages equal to the first threshold on any date the first day of the week
statusReason: expected { cost: 18 } to deeply equal { cost: 23 }

[Killed] EqualityOperator
dist/src/prices.js:55:29
                         res.json({ cost: Math.ceil(cost) });
                     }
                     else {
-                        if (req.query.age > 64) {
+                        if (req.query.age >= 64) {
                             let cost = result.cost * .75 * (1 - reduction / 100);
                             res.json({ cost: Math.ceil(cost) });
killedBy: prices day time cost on the first day of the week (non-holiday) given age equal to threshold
statusReason: expected { cost: 18 } to deeply equal { cost: 23 }

[Killed] ArithmeticOperator
dist/src/prices.js:56:40
                     }
                     else {
                         if (req.query.age > 64) {
-                            let cost = result.cost * .75 * (1 - reduction / 100);
+                            let cost = result.cost * .75 / (1 - reduction / 100);
                             res.json({ cost: Math.ceil(cost) });
                         }
killedBy: prices day time cost on the first day of the week (non-holiday) given age above threshold
statusReason: expected { cost: 41 } to deeply equal { cost: 18 }

[Killed] ArithmeticOperator
dist/src/prices.js:60:59
                             res.json({ cost: Math.ceil(cost) });
                         }
                         else {
-                            let cost = result.cost * (1 - reduction / 100);
+                            let cost = result.cost * (1 - reduction * 100);
                             res.json({ cost: Math.ceil(cost) });
                         }
killedBy: prices day time cost for ages equal to the first threshold on any date the first day of the week
statusReason: expected { cost: -122465 } to deeply equal { cost: 23 }

[Killed] EqualityOperator
dist/src/prices.js:67:21
                 }
             }
             else {
-                if (req.query.age >= 6) {
+                if (req.query.age > 6) {
                     if (req.query.age > 64) {
                         res.json({ cost: Math.ceil(result.cost * .4) });
killedBy: prices night time cost given an age matching the first threshold
statusReason: expected { cost: +0 } to deeply equal { cost: 19 }

[Killed] ConditionalExpression
dist/src/prices.js:67:21
                 }
             }
             else {
-                if (req.query.age >= 6) {
+                if (false) {
                     if (req.query.age > 64) {
                         res.json({ cost: Math.ceil(result.cost * .4) });
killedBy: prices night time cost given an age matching the first threshold
statusReason: expected { cost: +0 } to deeply equal { cost: 19 }

[Killed] EqualityOperator
dist/src/prices.js:68:25
             }
             else {
                 if (req.query.age >= 6) {
-                    if (req.query.age > 64) {
+                    if (req.query.age >= 64) {
                         res.json({ cost: Math.ceil(result.cost * .4) });
                     }
killedBy: prices night time cost given an age matching the second threshold
statusReason: expected { cost: 8 } to deeply equal { cost: 19 }
